[
    {
        "title": "Computer Science 4451A/B FOUNDATIONS OF MACHINE LEARNING",
        "content": "Course Description This course offers a general and comprehensive introduction to fundamental modern topics in machine learning while providing the mathematical basis and conceptual tools needed for understanding machine learning algorithms. It also describes several key aspects of the application of these algorithms. Antirequisite(s) Antirequisite(s): The former Computer Science 4442A/B. Pre or Corequisites Prerequisite(s): Data Science 3000A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4447A/B COMPILER THEORY",
        "content": "Course Description Syntax-directed translation; LR(k), LL(k), attribute grammars; code generation; optimization; compiler compilers; code generator generators. Pre or Corequisites Prerequisite(s): Computer Science 3331A/B and Computer Science 3342A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3350A/B COMPUTER ORGANIZATION",
        "content": "Course Description Topics include: semiconductor technologies, gates and circuits, buses, semiconductor memories, peripheral interfaces, I/O techniques, A/D conversion, standards, RISC. Antirequisite(s) Antirequisite(s): ECE 3375A/B . Pre or Corequisites Prerequisite(s): Computer Science 2208A/B, Computer Science 2210A/B, Computer Science 2211A/B, and either Computer Science 2209A/B or the former Computer Science 2101A/B. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4411A/B DATABASES II",
        "content": "Course Description Advanced database topics such as: query optimization and execution; advanced concurrency control and recovery concepts; distributed databases; XML databases; database security and privacy; databases in the cloud; information retrieval. Pre or Corequisites Prerequisite(s): Computer Science 3319A/B or Computer Science 3120A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2035A/B DEALING WITH DATA: ANALYSIS AND VISUALIZATION",
        "content": "Course Description Essential skills and computational tools for working with data from a number of disciplines. Uses MATLAB for data analysis and visualization through basic statistics, numerical computing, and programming, with interdisciplinary applications ranging from image processing to financial computing, and more. Suitable for both Computer Science and non-Computer Science students. Antirequisite(s) Antirequisite(s): Earth Sciences 2222A/B . Pre or Corequisites Prerequisite(s): 0.5 course in Applied Mathematics, Calculus, Mathematics, Statistics (including Introductory Statistics) at the 1000-level or above. Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3331A/B FOUNDATIONS OF COMPUTER SCIENCE I",
        "content": "Course Description Languages as sets of strings over an alphabet; operations on languages; finite automata, regular expressions; language hierarchy; Turing machines; models of computation. Pre or Corequisites Prerequisite(s): Computer Science 2214A/B or Mathematics 2155F/G . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2121A/B MODERN SURVIVAL SKILLS II: PROBLEM SOLVING THROUGH PROGRAMMING",
        "content": "Course Description An overview of core data structures and algorithms in computing, with a focus on applications to informatics and analytics in a variety of disciplines. Includes lists, stacks, queues, trees, graphs, and their associated algorithms; sorting, searching, and hashing techniques. Suitable for non-Computer Science students. Antirequisite(s) Antirequisite(s): Computer Science 1027A/B, Computer Science 1037A/B, Digital Humanities 2221A/B . Pre or Corequisites Prerequisite(s): Computer Science 2120A/B, Digital Humanities 2220A/B, Computer Science 1026A/B with a mark of at least 60% and registration in Medical Sciences First Entry, or Integrated Science 1001X with at least 60%. Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3342A/B ORGANIZATION OF PROGRAMMING LANGUAGES",
        "content": "Course Description Specification and analysis of programming languages; data types and structures; bindings and access structures; run-time behavior of programs; compilation vs. interpretation. Comparative presentation of at least three programming languages addressing the above concepts. Pre or Corequisites Prerequisite(s): Computer Science 2211A/B or Software Engineering 3313A/B . Extra Information Extra Information: 3 lecture hours. Completion of Computer Science 3331A/B prior to enrolling in Computer Science 3342A/B is recommended but not required. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4460Z BIOINFORMATICS THESIS",
        "content": "Course Description A project or research paper in an area related to bioinformatics, completed under faculty supervision. An oral presentation plus a written submission will be required. Antirequisite(s) Antirequisite(s): Computer Science 3380F/G/Z, Computer Science 4470Y, Computer Science 4480Y, Computer Science 4490Z . Pre or Corequisites Prerequisite(s): Computer Science 3331A/B and Computer Science 3340A/B ; plus 1.5 courses from: Biochemistry 2280A, Chemistry 2213A/B, Computer Science 3319A/B, Computer Science 3346A/B ; plus registration in the Honours Specialization in Bioinformatics (Biochemistry concentration) or the Honours Specialization in Bioinformatics (Computer Science concentration). Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4476A/B/Y SUMMER OF CODE",
        "content": "Course Description An examination of open source software development through Google's annual Summer of Code program. Students are exposed to real-world software development scenarios in mentored projects from a number of open source projects, gaining valuable and practical skills and experience in open source software development and maintenance. Antirequisite(s) Antirequisite(s): Computer Science 4437A/B/Y if taken during the Summer 2013 or 2014 academic terms. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y or permission of the Department. Extra Information Extra Information: 3 lecture hours.  Note: Students must notify the Department of their interest in registration in the course prior to the preceding May 1st for Computer Science 4476A/B/Y . Registration in the course is conditional upon acceptance into the Google Summer of Code program. Students are advised that the timeline for this program varies from year to year and it is their responsibility to ensure that they can participate in the program according to their schedule and needs. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3120A/B DATABASES FOR INFORMATICS AND ANALYTICS",
        "content": "Course Description A study of relational databases. Theoretical concepts will be covered, including relational algebra and relational calculus. Commercially available database systems will be used to demonstrate concepts such as Structured-Query-Language (SQL), writing code to connect and query a database, query optimization, Atomicity-Consistency-Isolation-Durability (ACID) concepts, and database design. Antirequisite(s) Antirequisite(s): Computer Science 3319A/B, Software Engineering 3309A/B, Digital Humanities 3220A/B . Pre or Corequisites Prerequisite(s): Computer Science 2121A/B or Digital Humanities 2221A/B . Extra Information Extra Information: 3 lecture hours Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4457A/B/Y COMPUTER NETWORKS II",
        "content": "Course Description Network layering, performance, management, modelling and simulation; faults and failures. Pre or Corequisites Prerequisite(s): Computer Science 3357A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4418A/B INTRODUCTION TO VISUAL ANALYTICS",
        "content": "Course Description Students will learn how to conceptualize and design systems that integrate data visualization, interactive machine learning, and human-data interaction to support complex data-driven analytical tasks and activities which humans encounter in different fields. Visual analytics concepts and components will be studied in the context of human-centred computing. Pre or Corequisites Prerequisite(s): Data Science 3000A/B (or the former Computer Science 4414A/B) or Computer Science 4437A/B/Y if taken during Fall/Winter 2016 or 2017. Pre-or Corequisite(s): Computer Science 4416A/B is recommended. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3121A/B ARTIFICIAL INTELLIGENCE FOR INFORMATICS AND ANALYTICS",
        "content": "Course Description An introduction to artificial intelligence, focused on its application to informatics and analytics. Topics include knowledge representation; logic and reasoning; searching; inferencing; expert systems. Suitable for non Computer Science students. Antirequisite(s) Antirequisite(s): Computer Science 3346A/B . Pre or Corequisites Prerequisite(s): Computer Science 2121A/B . Extra Information Extra Information: 3 lecture hours.. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4433A/B/Y SELECTED TOPICS",
        "content": "Course Description Advanced Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Pre or Corequisites Prerequisite(s): 2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; or permission of the Department. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2212A/B/Y INTRODUCTION TO SOFTWARE ENGINEERING",
        "content": "Course Description A team project course that provides practical experience in the software engineering field. Introduction to the structure and unique characteristics of large software systems, and concepts and techniques in the design, management and implementation of large software systems. Antirequisite(s) Antirequisite(s): Software Engineering 2203A/B if taken before the 2022-2023 academic year. Pre or Corequisites Prerequisite(s): Computer Science 2210A/B and Computer Science 2211A/B . Extra Information Extra Information: 3 lecture/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4473A/B REQUIREMENT ANALYSIS",
        "content": "Course Description The development of requirements for software-intensive systems through successful requirements analysis techniques and requirements engineering; an in-depth study of methods, tools, notations, and validation techniques for the analysis and specification of software requirements. Antirequisite(s) Antirequisite(s): Software Engineering 3352A/B . Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3340A/B ANALYSIS OF ALGORITHMS I",
        "content": "Course Description Upper and lower time and space bounds; levels of intractability; graph algorithms; greedy algorithms; dynamic algorithms; exhaustive search techniques; parallel algorithms. Pre or Corequisites Prerequisite(s): Computer Science 2210A/B and Computer Science 2211A/B ; Computer Science 2214A/B or Mathematics 2155F/G ; or registration in the fourth year of a BESc program in Artificial Intelligence Systems Engineering (AISE) or Computer Engineering. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2120A/B MODERN SURVIVAL SKILLS I: CODING ESSENTIALS",
        "content": "Course Description Essential information processing and coding skills for students. Includes core concepts of algorithms and data structures; creating programs and scripts to address problems that arise in applied research; examples of data sets and analyses drawn from a variety of disciplines. No previous programming background assumed. Antirequisite(s) Antirequisite(s): Computer Science 1025A/B or Computer Science 1026A/B, Data Science 1200A/B, Engineering Science 1036A/B, Digital Humanities 2220A/B . Extra Information Extra Information: 3 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4483A/B GAME DESIGN",
        "content": "Course Description Concepts and issues that arise in the development of games for entertainment and serious game applications, focusing on providing players with more engaging, immersive, and rewarding gameplay experiences. Group project normally required. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y, or Software Engineering 3350A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4463A/B COMPUTATIONAL BIOLOGY",
        "content": "Course Description Bioinformatics studies biological problems using biological, computational, and mathematical methods. Computational biology studies computational techniques that can solve biological problems efficiently. This course emphasizes the design, analysis and implementation of algorithms for problems motivated from molecular biology research. Pre or Corequisites Prerequisite(s): Computer Science 3331A/B and Computer Science 3340A/B, or Software Engineering 2205A/B and Software Engineering 3310A/B ; Biochemistry 2280A is recommended. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4482A/B GAME PROGRAMMING",
        "content": "Course Description Core concepts and techniques of game programming, including the development and usage of game engines for the creation of games. Topics from: game engine architecture; real-time 2D and 3D rendering; character animation; shaders; real-time physics simulation, artificial intelligence, and networking; procedural methods; player input and controls; platform considerations; tools development. Pre or Corequisites Prerequisite(s): ( Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3340A/B ); or ( Software Engineering 2205A/B, Software Engineering 3310A/B, Software Engineering 3313A/B, and Software Engineering 3350A/B ); and 0.5 course from Mathematics 1600A/B or Applied Mathematics 1411A/B. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3305A/B OPERATING SYSTEMS",
        "content": "Course Description Survey of major operating systems; interprocess communication; multi-tasking; scheduling; memory management; performance and measurement issues; trade-offs in operating system design; concurrency and deadlock. Antirequisite(s) Antirequisite(s): Software Engineering 3313A/B . Pre or Corequisites Prerequisite(s): Either ( Computer Science 2208A/B and Computer Science 2211A/B ) or (the former Computer Science 2101A/B and Computer Science 2208A/B ) or ( Computer Science 2210A/B, Computer Science 2211A/B, ECE 3375A/B, and registration in the fourth year of a BESc program in Computer Engineering or Mechatronic Systems Engineering.) Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3346A/B ARTIFICIAL INTELLIGENCE I",
        "content": "Course Description Introduction to Artificial Intelligence; logic programming; heuristic search; knowledge representation; expert systems. Antirequisite(s) Antirequisite(s): Computer Science 3121A/B . Pre or Corequisites Prerequisite(s): Either ( Computer Science 2210A/B and Computer Science 2211A/B ) or ( Software Engineering 2203A/B, Software Engineering 2205A/B and Software Engineering 2250A/B ); Computer Science 2209A/B, or registration in a BESc program in Computer Engineering, Mechatronic Systems Engineering, or Software Engineering. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4458A/B NETWORK SECURITY",
        "content": "Course Description This course will aim at providing a comprehensive understanding of various security issues in an end-to-end network. The list of these topics includes message/user authentication, cryptographic key management, web security, TLS, wireless/5G security, e-mail security, DNS security, IPSec, VPN security, Malware, Firewall, network intrusion detection/prediction/prevention, DoS/DDoS, Cloud and IoT Security. Antirequisite(s) Antirequisite(s): Computer Science 4434A/B, if taken during the 2021-2022 academic year; Computer Science 4457A/B, if taken during the 2020-2021 academic year. Pre or Corequisites Prerequisite(s): ( Computer Science 3305A/B or Software Engineering 3313A/B ) and ( Computer Science 3357A/B or Electrical and Computer Engineering 4436A/B ). Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2214A/B DISCRETE STRUCTURES FOR COMPUTING",
        "content": "Course Description This course presents an introduction to the mathematical foundations of computer science, with an emphasis on mathematical reasoning, combinatorial analysis, discrete structures, applications and modeling, and algorithmic thinking. Topics include sets, functions, relations, algorithms, number theory, matrices, mathematical reasoning, counting, graphs and trees. Antirequisite(s) Antirequisite(s): Mathematics 2151A/B, Mathematics 2155F/G . Pre or Corequisites Prerequisite(s): Either 1) Computer Science 1027A/B, Computer Science 1037A/B, Computer Science 2121A/B or Digital Humanities 2221A/B in each case with at least 65%; and Computer Science 1020A/B with at least 60%, and 1.0 course with at least 60% in each from: Applied Mathematics 1201A/B, Numerical and Mathematical Methods 1411A/B, Numerical and Mathematical Methods 1412A/B, Numerical and Mathematical Methods 1414A/B, Calculus 1000A/B, Calculus 1301A/B, Calculus 1500A/B, Calculus 1501A/B, Mathematics 1600A/B, the former Applied Mathematics 1411A/B, the former Applied Mathematics 1412A/B, the former Applied Mathematics 1414A/B, the former Applied Mathematics 1413; or 2) Integrated Science 1001X and Computer Science 1020A/B with at least 60% for both. Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2033A/B MULTIMEDIA AND COMMUNICATION II",
        "content": "Course Description This course continues the exploration of popular media and Internet technologies. Topics include advanced photo editing techniques; website development with HTML, CSS, and JavaScript; making websites more interactive; form validation; Bootstrap websites; and the significance of CMS's and e-commerce platforms. Antirequisite(s) Antirequisite(s): MediaCom 2570A/B, Digital Communication 2203A/B . Pre or Corequisites Prerequisite(s): Computer Science 1033A/B . Extra Information Extra Information: 2 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4435A/B/Y SELECTED TOPICS",
        "content": "Course Description Advanced Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Pre or Corequisites Prerequisite(s): Computer Science 3305A/B or Computer Science 3357A/B ; Computer Science 3307A/B/Y, Computer Science 3340A/B, or Computer Science 3342A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4490Z THESIS",
        "content": "Course Description A project or research paper completed with minimal faculty supervision. An oral presentation plus a written submission will be required. Antirequisite(s) Antirequisite(s): Computer Science 3380F/G/Z, Computer Science 4460Z, Computer Science 4470Y, Computer Science 4480Y . Pre or Corequisites Prerequisite(s): (2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; plus registration in the Honours Specialization in Computer Science) or (2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3319A/B, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3357A/B ; plus registration in the Honours Specialization in Information Systems). Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2209A/B APPLIED LOGIC FOR COMPUTER SCIENCE",
        "content": "Course Description Propositional and predicate logic; representing static and dynamic properties of real-world systems; logic as a tool for representation, reasoning and calculation; logic and programming. Pre or Corequisites Prerequisite(s): Either 1) Computer Science 1027A/B, Computer Science 1037A/B, Computer Science 2121A/B or Digital Humanities 2221A/B in each case with at least 65%; and Computer Science 1020A/B with at least 60%, and 1.0 course with at least 60% in each from: Applied Mathematics 1201A/B, Numerical and Mathematical Methods 1411A/B, Numerical and Mathematical Methods 1412A/B, Numerical and Mathematical Methods 1414A/B, Calculus 1000A/B, Calculus 1301A/B, Calculus 1500A/B, Calculus 1501A/B, Mathematics 1600A/B, the former Applied Mathematics 1411A/B, the former Applied Mathematics 1412A/B, the former Applied Mathematics 1414A/B, the former Applied Mathematics 1413; or 2) Integrated Science 1001X and Computer Science 1020A/B with at least 60% for both. Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4416A/B DATA SCIENCE II",
        "content": "Course Description Students will learn to develop and extend data science methods in order to solve new problems. Approaches covered will include convex loss/regularization, graphical models, and neural networks. Pre or Corequisites Prerequisite(s): Data Science 3000A/B (or the former Computer Science 4414A/B) or Computer Science 4437A/B/Y if taken during Fall/Winter 2016 or 2017. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4446A/B INTERNET ALGORITHMICS",
        "content": "Course Description This course focuses on the study of algorithms for solving problems that arise from the design and use of large networks, like the Internet. Topics include: Computer networks and internets, distributed algorithms, peer-to-peer systems, the Web graph and searching for information in the Web, caching, and Game Theory. Antirequisite(s) Antirequisite(s): Computer Science 4438A/B, if taken during the 2018-2019, 2021-2022 academic years; Software Engineering 3314A/B . Pre or Corequisites Prerequisite(s): Either Computer Science 3340A/B or Software Engineering 3310A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4438A/B/Y SELECTED TOPICS",
        "content": "Course Description Advanced Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Pre or Corequisites Prerequisite(s): 2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; or permission of the Department. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4475A/B OPEN SOURCE SOFTWARE PROJECT",
        "content": "Course Description An examination of large-scale software development in the context of a distributed, multi-university open source software project organized by the Undergraduate Capstone Open Source Projects (UCOSP) initiative (see http://ucosp.ca for details).  Students will receive practical hands-on experience in working in software development, as well as valuable soft skills and team experience. Antirequisite(s) Antirequisite(s): Computer Science 4438A/B/Y if taken during the 2012-2013 academic year. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y or permission of the Department. Extra Information Extra Information: 3 lecture hours.\r\nNote: Students must notify the Department of their interest in registration in the course prior to the preceding May 1st for Computer Science 4475A or September 1st for Computer Science 4475B.  Registration in the course is conditional and competitive as course costs and coordination are provided by UCOSP.  A committee will adjudicate students on the basis of grades in program courses and a statement of interest submitted as part of the application process.  Students must be able to travel to an initial meeting at the beginning of the course; in the case that this meeting is outside of Canada, students will need valid travel documentation and must consult with the Department in advance if this is an issue.  Costs related to this travel will be reimbursed by UCOSP; details will be provided prior to registration. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4472A/B SPECIFICATION TESTING AND QUALITY",
        "content": "Course Description Concepts and state of the art techniques in software specification and quality assessment for software engineering; quality attributes; formal specification and analysis; verification and validation. Antirequisite(s) Antirequisite(s): Software Engineering 4452A/B, the former Software Engineering 4453A/B. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1020A/B FOUNDATIONS OF COMPUTER SCIENCE",
        "content": "Course Description This introductory computer science course covers core concepts such as logic, proofs, number systems, and probability theory, linking theory to practical applications. It highlights various Computer Science streams and their real-world uses, preparing students for second-year courses and guiding their future academic and career paths. Pre or Corequisites Prerequisite(s): (Ontario Secondary School MHF4U and Ontario Secondary School MCV4U) or Mathematics 0110A/B ; and registration in the Computer Science Program or completion of first-year requirements. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1037A/B COMPUTER SCIENCE FUNDAMENTALS II",
        "content": "Course Description A continuation for Engineering Science 1036A/B . Data organization and manipulation; abstract data types and their implementations in the C programming language; lists, stacks, queues, trees; pointers; recursion; file handling and storage. Intended for students in the Faculty of Engineering. Antirequisite(s) Antirequisite(s): Computer Science 1027A/B, Computer Science 2121A/B, Digital Humanities 2221A/B . Pre or Corequisites Prerequisite(s): Engineering Science 1036A/B . Extra Information Extra Information: 3 lecture hours, 2 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1026A/B COMPUTER SCIENCE FUNDAMENTALS I",
        "content": "Course Description The nature of Computer Science as a discipline; the design and analysis of algorithms and their implementation as modular, reliable, well-documented programs written in  a modern programming language. Intended for students with little or no background in programming. Antirequisite(s) Antirequisite(s): Computer Science 1025A/B, Computer Science 2120A/B, Data Science 1200A/B, Engineering Science 1036A/B, Digital Humanities 2220A/B . Extra Information Extra Information: 3 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2208A/B INTRODUCTION TO COMPUTER ORGANIZATION AND ARCHITECTURE",
        "content": "Course Description This course gives an understanding of what a modern computer can do. It covers the internal representation of various data types and focuses on the architectural components of computers (how these components are interconnected and the nature of the information flow between them). Assembly language is used to reinforce these issues. Pre or Corequisites Prerequisite(s): Either (1) Computer Science 1027A/B, Computer Science 1037A/B, in each case with at least 65%; and Computer Science 1020A/B with at least 60%; or (2) Integrated Science 1001X and Computer Science 1020A/B with at least 60% for both. Extra Information Extra Information: 3 lecture hours, 1 laboratory hour, 1 tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4452A/B DEEP LEARNING IN COMPUTER VISION",
        "content": "Course Description This course explores Deep Learning and its applications in Computer Vision, focusing on theory and practical skills. Designed for students with basic machine learning knowledge, it empowers them to solve real-world vision-related problems and provides a robust foundation in this rapidly evolving field. Antirequisite(s) Antirequisite(s): The former Computer Science 4442A/B. Pre or Corequisites Prerequisite(s): Data Science 3000A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1046A/B APPROACHABLE APPS: AN INTRODUCTION TO PROGRAMMING USING JAVASCRIPT",
        "content": "Course Description Foundations of app development for the web and mobile devices. An introduction to basic programming and scripting concepts, and technologies such as JavaScript, HTML, and CSS, which will be used to create a variety of apps and games. This course is intended for students with no prior programming or computing background. Antirequisite(s) Antirequisite(s): Computer Science 1025A/B, Computer Science 1026A/B, Computer Science 2120A/B, Data Science 1200A/B, Engineering Science 1036A/B and Software Engineering 2202A/B . Extra Information Extra Information: 2 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3388A/B COMPUTER GRAPHICS I",
        "content": "Course Description The viewing pipeline; clipping and visibility problems. The graphical kernel system; picture generation and user interfaces. Pre or Corequisites Prerequisite(s): ( Computer Science 2211A/B or the former Computer Science 2101A/B) or ( Software Engineering 2203A/B, Software Engineering 2205A/B and Software Engineering 2250A/B ); one of Mathematics 1600A/B, Numerical and Mathematical Methods 1411A/B or the former Applied Mathematics 1411A/B. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4434A/B/Y SELECTED TOPICS",
        "content": "Course Description Advanced Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Antirequisite(s) Antirequisite(s): Computer Science 4457A/B/Y . Pre or Corequisites Prerequisite(s): Computer Science 3305A/B and Computer Science 3357A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4459A/B SELECTED TOPICS ON SCALABLE AND ROBUST DISTRIBUTED SYSTEMS",
        "content": "Course Description This course presents fundamental concepts related to the design and implementation of distributed systems. The course teaches the abstractions, design and algorithms that enable the development of scalable and robust distributed systems. Topics include interprocess communication, clocks, replication, data consistency models, consistent hashing, and failure handling. Antirequisite(s) Antirequisite(s): Computer Science 4435A/B, if taken during the 2021-2022 academic year. Pre or Corequisites Prerequisite(s): 0.5 course from: Computer Science 3305A/B, Computer Science 3357A/B, Electrical and Computer Engineering 4436A/B, Software Engineering 3313A/B, Software Engineering 3314A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4481A/B IMAGE COMPRESSION",
        "content": "Course Description Dealing with digital pictures (images) requires far more computer memory and transmission time than is needed for plain text. This course provides students with a solid understanding of the fundamentals and the principles of various digital still-image compression schemes. Pre or Corequisites Prerequisite(s): 0.5 course from: Computer Science 3305A/B, 3307A/B/Y, or 3342A/B. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1033A/B MULTIMEDIA AND COMMUNICATION I",
        "content": "Course Description This course explores the use of different types of media (e.g., text, images, sound, animation) to convey ideas and facilitate interaction. Topics include the design and use of a range of software tools for media creation and editing, covering image, sound, animation and video. This knowledge will be applied to authoring web sites. Extra Information Extra Information: 2 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4413A/B CRYPTOGRAPHY AND SECURITY",
        "content": "Course Description Survey of the principles and practice of cryptography and network security: classical cryptography, public-key cryptography and cryptographic protocols, network and system security. Pre or Corequisites Prerequisite(s): Computer Science 3340A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4471A/B SOFTWARE DESIGN AND ARCHITECTURE",
        "content": "Course Description Introduction to advanced software design concepts; architectures of complex software systems; domain-independent design patterns; creation of a functional partitioning for a novel domain; recognition of common architectural idioms. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3319A/B DATABASES I",
        "content": "Course Description A study of relational databases. Theoretical concepts will be covered, including relational algebra and relational calculus. Commercially available database systems will be used to demonstrate concepts such as Structured-Query-Language (SQL), writing code to connect and query a database, query optimization, Atomicity-Consistency-Isolation-Durability (ACID) concepts, and database design. Antirequisite(s) Antirequisite(s): AISE 3309A/B, Computer Science 3120A/B, Digital Humanities 3220A/B, and Software Engineering 3309A/B . Pre or Corequisites Prerequisite(s): Computer Science 2210A/B and Computer Science 2211A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3335A/B/Y SELECTED TOPICS",
        "content": "Course Description Special topics on the frontiers of Computer Science. The topic may vary each year. Pre or Corequisites Prerequisite(s): Computer Science 2208A/B, Computer Science 2209A/B, Computer Science 2212A/B/Y . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4461A/B BIOINFORMATICS TOOLS AND APPLICATIONS",
        "content": "Course Description Introduction to popular bioinformatics software tools and their applications in solving complex biological problems; analysis of the algorithms behind bioinformatics tools. Pre or Corequisites Prerequisite(s): Computer Science 3331A/B and Computer Science 3340A/B ; Biochemistry 2280A is recommended. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3357A/B COMPUTER NETWORKS I",
        "content": "Course Description Common network protocols; inter-networking; gateways; routers; bridges; survey of commercial architectures; standards. Antirequisite(s) Antirequisite(s): ECE 4436A/B, AISE 4430A/B . Pre or Corequisites Prerequisite(s): Computer Science 2210A/B and Computer Science 2211A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4470Y SOFTWARE MAINTENANCE AND CONFIGURATION MANAGMENT",
        "content": "Course Description An examination of industrial-style software development issues related to managing and maintaining large-scale software systems; in a group project, students will examine software maintenance and configuration management concepts, tools, techniques, risks and benefits; case studies. Antirequisite(s) Antirequisite(s): Computer Science 3380F/G/Z, Computer Science 4460Z, Computer Science 4480Y, Computer Science 4490Z, the former Software Engineering 4453A/B. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y ; plus 1.5 courses from: Computer Science 3305A/B, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; plus registration in the Minor in Software Engineering. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3307A/B/Y OBJECT-ORIENTED DESIGN AND ANALYSIS",
        "content": "Course Description Software design and analysis techniques with particular emphasis on object-oriented design and analysis; a team project will be developed using an object-oriented language such as Java, C++ or Smalltalk. Antirequisite(s) Antirequisite(s): Software Engineering 3350A/B if taken before the 2022-2023 academic year. Pre or Corequisites Prerequisite(s): Either ( Computer Science 2212A/B/Y ) or ( Computer Science 2210A/B, Computer Science 2211A/B, Electrical and Computer Engineering 3375A/B, and registration in the fourth year of a BESc program in Computer Engineering or Mechatronic Systems Engineering.) Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2034A/B DATA ANALYTICS: PRINCIPLES AND TOOLS",
        "content": "Course Description A comprehensive and interdisciplinary introduction to data analytics using modern computing systems, with equal attention to fundamentals and practical aspects. Topics include sources of data, data formats and transformation, usage of spreadsheets and databases, statistical analysis, pattern recognition, data mining, big data, and methods for data presentation and visualization. Antirequisite(s) Antirequisite(s): Digital Humanities 2144A/B, Earth Sciences 2222A/B . Extra Information Extra Information: 2 lecture hours, 2 laboratory/tutorial hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4402A/B PARALLEL AND DISTRIBUTED COMPUTING",
        "content": "Course Description This course studies the fundamental aspects of parallel and distributed systems, providing an integrated view of the various facets of software development on such systems: hardware architectures, programming languages, computational models, software development tools and design patterns, performance modelling and analysis, experimenting and measuring, application to scientific computing. Pre or Corequisites Prerequisite(s): ( Computer Science 3340A/B or Software Engineering 3310A/B ) and ( Computer Science 3350A/B or ECE 3375A/B ). Extra Information Extra Information: 3 lecture hours. Note: Computer Science 3331A/B and Computer Science 3305A/B or equivalent are recommended. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2210A/B DATA STRUCTURES AND ALGORITHMS",
        "content": "Course Description Lists, stacks, queues, priority queues, trees, graphs, and their associated algorithms; file structures; sorting, searching, and hashing techniques; time and space complexity. Antirequisite(s) Antirequisite(s): Software Engineering 2205A/B . Pre or Corequisites Prerequisite(s): Either 1) Computer Science 1027A/B, Computer Science 1037A/B, the former Computer Science 2101A/B, Computer Science 2121A/B or Digital Humanities 2221A/B in each case with at least 65%, and 1.0 course with at least 60% in each from: Applied Mathematics 1201A/B, Numerical and Mathematical Methods 1411A/B, Numerical and Mathematical Methods 1412A/B, Numerical and Mathematical Methods 1414A/B, Calculus 1000A/B, Calculus 1301A/B, Calculus 1500A/B, Calculus 1501A/B, Mathematics 1600A/B, the former Applied Mathematics 1411A/B, the former Applied Mathematics 1412A/B, the former Applied Mathematics 1414A/B, the former Applied Mathematics 1413; or 2) Integrated Science 1001X with at least 60%. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4478A/B/Y MASTER THE MAINFRAME",
        "content": "Course Description The mainframe remains a critical piece of infrastructure for enterprise computing, with experts highly sought after by industry. This course studies the mainframe through IBM's annual Master the Mainframe program. Students are exposed to real-world development through hands-on projects, gaining valuable experience and skills for working with modern mainframe systems. Antirequisite(s) Antirequisite(s): Computer Science 4434A/B/Y if taken during Fall/Winter 2014. Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y or permission of the Department. Extra Information Extra Information: 3 lecture hours. Note: Registration in the course is conditional upon acceptance into the IBM Master the Mainframe program. Students are advised that the timeline for this program varies from year to year and it is their responsibility to ensure that they can participate in the program according to their schedule and needs; consultation with the Department prior to registration is highly recommended. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1025A/B COMPUTER SCIENCE FUNDAMENTALS I",
        "content": "Course Description The nature of Computer Science as a discipline; the design and analysis of algorithms and their implementation as modular, reliable, well-documented programs written in a modern programming language. Intended for students with significant programming experience in at least one high-level block-structured or object-oriented language. Antirequisite(s) Antirequisite(s): Computer Science 1026A/B, Computer Science 2120A/B, Data Science 1200A/B, Engineering Science 1036A/B, Digital Humanities 2220A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 2211A/B SOFTWARE TOOLS AND SYSTEMS  PROGRAMMING",
        "content": "Course Description An introduction to software tools and systems programming. Topics include: understanding how programs execute (compilation, linking and loading); an introduction to a complex operating system (UNIX); scripting languages; the C programming language; system calls; memory management; libraries; multi-component program organization and builds; version control; debuggers and profilers. Pre or Corequisites Prerequisite(s): Either 1) Computer Science 1027A/B, Computer Science 1037A/B, or the former Computer Science 2101A/B, in each case with a mark of at least 65% or 2) Integrated Science 1001X with at least 60%. Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3333A/B SELECTED TOPICS",
        "content": "Course Description Special topics on the frontiers of Computer Science. The topic may vary each year. Pre or Corequisites Prerequisite(s): Computer Science 2208A/B, Computer Science 2209A/B, Computer Science 2212A/B/Y . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1032A/B INFORMATION SYSTEMS AND DESIGN",
        "content": "Course Description Techniques used for determining technological needs of businesses; building and managing systems to meet those needs; development roles of individuals and organizations; planning and management of concepts, personnel and processes; related software tools (spreadsheets, databases). Intended primarily for Management and Organizational Studies students. Antirequisite(s) Antirequisite(s): Management and Organizational Studies 1033A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3380F/G/Z PROJECT",
        "content": "Course Description A supervised study involving a research paper, the design of or development of a software project. Antirequisite(s) Antirequisite(s): Computer Science 4460Z, Computer Science 4470Y, Computer Science 4480Y, Computer Science 4490Z . Pre or Corequisites Prerequisite(s): Permission from the department, plus: Computer Science 2212A/B/Y and registration in the Specialization or Major in Computer Science. To be allowed into this course, the student must have found a topic and a willing departmental supervisor before the end of the add period. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 1027A/B COMPUTER SCIENCE FUNDAMENTALS II",
        "content": "Course Description A continuation for both Computer Science 1025A/B and Computer Science 1026A/B . Data organization and manipulation; abstract data types and their implementations in a modern programming language; lists, stacks, queues, trees; recursion; file handling and storage. Antirequisite(s) Antirequisite(s): Computer Science 1037A/B, Computer Science 2121A/B, Digital Humanities 2221A/B . Pre or Corequisites Prerequisite(s): Computer Science 1025A/B, Computer Science 1026A/B, Data Science 1200A/B, or Engineering Science 1036A/B, (in each case with a mark of at least 65%). Extra Information Extra Information: 3 lecture hours, 1 laboratory/tutorial hour. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4445A/B ANALYSIS OF ALGORTIHMS II",
        "content": "Course Description Parallel, distributed, probabilistic, and geometric algorithms; design and analysis; computational geometry; fractals and graphtals. Pre or Corequisites Prerequisite(s): Computer Science 3340A/B or ( Software Engineering 2205A/B and Software Engineering 3310A/B ). Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4437A/B/Y SELECTED TOPICS",
        "content": "Course Description Advanced Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Pre or Corequisites Prerequisite(s): 2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; or permission of the Department. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4474A/B HUMAN-COMPUTER INTERACTION",
        "content": "Course Description Exposure to topics in human-computer interaction, including: frameworks for human-computer interaction; requirements gathering; rapid prototyping; user interface systems and tool kits. Antirequisite(s) Antirequisite(s): Software Engineering 3353A/B . Pre or Corequisites Prerequisite(s): Computer Science 3307A/B/Y Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4480Y GAME DEVELOPMENT PROJECT",
        "content": "Course Description Industrial-style development issues related to the creation of games of commercial scale and quality, both for entertainment and serious game applications; in a group project, students will examine concepts, theories, tools, technologies, and techniques for code and content generation for modern games. Antirequisite(s) Antirequisite(s): Computer Science 3380F/G/Z, Computer Science 4460Z, Computer Science 4470Y, Computer Science 4490Z . Pre or Corequisites Prerequisite(s): Registration in the Minor in Game Development. Corequisite(s): Computer Science 4482A/B, Computer Science 4483A/B . Extra Information Extra Information: 2 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3377A/B SOFTWARE PROJECT MANAGEMENT",
        "content": "Course Description The software development life cycle; resourcing, scheduling and estimating techniques for software project management; project management organizational concerns, including project economic analysis, human resources, proposal development, risk management, software implementation, and technology-strategic alignment. Antirequisite(s) Antirequisite(s): Science 3377A/B, SE 3351A/B . Pre or Corequisites Prerequisite(s): Registration in third or fourth year of any module offered by the Department of Computer Science. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4453A/B INTRODUCTION TO REINFORCEMENT LEARNING",
        "content": "Course Description This course explores fundamental concepts, algorithms, and applications in reinforcement learning, bridging AI and machine learning. Through lectures and practical exercises, students study Markov Decision Processes, Bellman equations, and key algorithms such as Q-learning, and DQN. They discover Reinforcement Learnings road applicability in robotics, gaming, finance, and healthcare domains. Pre or Corequisites Prerequisite(s): Data Science 3000A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4417A/B UNSTRUCTURED DATA",
        "content": "Course Description Management and analysis of unstructured data, with a focus on text data, for example transaction logs, news text, article abstracts, and microblogs. Overview of unstructured image, audio, and video data. Hands-on experience with modern distributed data management and analysis infrastructure. Antirequisite(s) Antirequisite(s): Computer Science 4433A/B/Y if taken during Fall/Winter 2017 or 2018. Pre or Corequisites Prerequisite(s): AISE 3309A/B or Computer Science 3319A/B . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 3336A/B/Y SELECTED TOPICS",
        "content": "Course Description Special topics on the frontiers of Computer Science. The topic may vary each year. Pre or Corequisites Prerequisite(s): Computer Science 2208A/B, Computer Science 2209A/B, Computer Science 2212A/B/Y . Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science 4436A/B/Y SELECTED TOPICS",
        "content": "Course Description Computer Science topics, reflecting current research interests within the Department. The particular topics will be available from the Department prior to registration. Pre or Corequisites Prerequisite(s): 2.0 courses from: Computer Science 3305A/B, Computer Science 3307A/B/Y, Computer Science 3331A/B, Computer Science 3340A/B, Computer Science 3342A/B, Computer Science 3350A/B ; or permission of the Department. Extra Information Extra Information: 3 lecture hours. Course Weight: 0.50 Breadth: CATEGORY C i Subject Code: COMPSCI"
    },
    {
        "title": "Computer Science - Western University",
        "content": "Fall 2024 Meet and Greet News and Announcements Arto Salomaa Tribute 02/28/2025 - Mathematician and theoretical computer scientist Arto Salomaa passed away on January 26, 2025. Arto served three years at Western in the late 1960s during which his first book, Theory of Automata, was published, and was made Doctor Honoris Causa of The University of Western Ontario in 2013. ... Read More Faculty of Science Award for Excellence in Graduate Student Mentoring 11/21/2024 - We are delighted to announce that Dr. Anwar Haque has been awarded this years Faculty of Science Award for Excellence in Graduate Student Mentoring. ... Read More AI Transforms Job Portal 06/25/2024 - By leveraging generative AI technologies, Dr Anwar Haque and his team at Bamboo Innovations, helped the London Economic Development Corporation (LEDC) transform their job portal. ... Read More Faculty of Science Distinguished Research Professor Award 05/03/2024 - We would like to congratulate Dr. Anwar Haque on being the recipient of this years Faculty of Science Distinguished Research Professor Award. ... Read More All News Articles... Explore Computer Science at Western Events Our Social Media 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "History",
        "content": "About Reminiscences From Past Chairs John Hart Dr. Hart was the first head of the Department of Computer Science, serving from 1964 to 1978. He retired in 1978. Ted Elcock Dr. Elcock served as Department Chair from 1973 to 1983. He retired in 1990. Irene Gargantini Dr. Gargantini served as Department Chair from 1986 to 1991. She retired in 2000. Michael Bauer Dr. Bauer served as Department Chair from 1991 to 1996 and again from 2002 to 2007. He retired in 2022. Hanan Lutfiyya Dr. Lutfiyya served as Department Chair from 2011 to 2016, and 2017-2020. About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Alumni",
        "content": "About FEATURED ALUMNI Amanda Holden Amanda Holden, class of 1987, graduated with an HBSc in Computer Science. She currently works at Interac as a Chief Information Officer. Peter Scheyen Peter Scheyen, class of 1992, graduated with an HBSc in Computer Science. He currently works at Cineplex Digital Networks as a Chief Technology Officer. Resources Graduating Class Photos About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Research",
        "content": "Research Our department is active in both traditional areas of computer science and emerging areas. The quality and diversity of the Department's research activities is internationally recognized. The Department is supported with research grants from a number of sources including the Natural Sciences and Engineering Council (NSERC), Canada Foundation for Innovation (CFI), Ontario Research Fund (ORF) and MITACS. Our researchers are involved in several collaborative initiatives both within the university and with external university and industrial partners. Artificial Intelligence, Data Science, and Games Data Science Human Information Interaction Machine Learning Game Analytics Visual Analytics Computer vision Data Management Event History Analysis Data Management Bioinformatics Computer Algebra Computer Vision and Image Analysis Computational Neuroscience Daley Lab Diedrichsen Lab Mohsenzadeh Lab Covid-19 Canada B.Wang Lab Computer Systems and Networks M.Bauer Info A.Haque Lab H.Lutfiyya Lab M.Milani Lab Software engineering Theoretical Computer Science L.Ilie Info R.Solis-Oba Info K.Zhang info Research 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "About",
        "content": "About Established in 1964, the Department of Computer Science at Western has developed strong academic and research programs to become one of the leading establishments in its field. Our faculty are the recipients of many teaching and research awards. Undergraduates can specialize in computer science and pick up a minor in gaming, software engineering, theoretical computer science and applications in computer science. Undergraduates in other disciplines can major or minor in computer science. There are many industrial and research opportunities for our undergraduate students. Our department is active in both the traditional research areas of computer science and emerging areas. The quality and diversity of the Department's research activities is internationally recognized. The Department is supported with research grants from a number of sources including the Natural Sciences and Engineering Council (NSERC), Canada Foundation for Innovation (CFI), Ontario Research Fund (ORF) and MITACS. Our researchers are involved in several collaborative initiatives both within the university and with external university and industrial partners. The Department has strong international and industrial links, with connections to other universities and companies in London, across North America and Europe. This provides opportunities for students to involve themselves in exchange programs, or engage in work with researchers in other countries. Previous Department Photos About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Bit By Bit Summer Camp",
        "content": "Computer Science Outreach Programming. Robotics. Graphics. Sports. Games.Fun. Designed For Your Child Our curriculum makes use of experiential learning principles and is designed for campers ages 9-13, regardless of experience or skill level. Campers with beginning or advanced computer experience alike will find a stimulating, engaging curriculum. A Head Start in a New World Computers are everywhere. Employers today seek candidates with strong technical skills, even for jobs not traditionally associated with computers. Learning these skills at a young age will give your child a head start that will be useful in many areas of life, and applicable in just about any field your child might one day choose. Fun and Games While Bit By Bit aims to provide a solid grounding in technical skills, your child won't be stuck indoors, sitting in front of a computer all day. With robotics competitions, daily outdoor games, swimming, and other group activities, your child will enjoy plenty of time for exercise and socialization with peers. Computer Science Outreach 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Facilities",
        "content": "Facilities The Department of Computer Science occupies the 3rd and 4th floors of Middlesex College along with good portions of the 2nd and ground floors. The department consists of faculty and staff offices, graduate office space, research labs, and computer systems rooms, as well as a number of undergraduate computing labs. Facilities 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Arto Salomaa Tribute",
        "content": "Mathematician and theoretical computer scientist Arto Salomaa passed away on January 26, 2025. He played a key role in the establishment and early development of the European Association for Theoretical Computer Science (EATCS) , and served as its President from 1979 to 1985. The following is an excerpt from the preface to a Special Issue of Theoretical Computer Science (track C) published in Arto Salomaas honor. Arto Salomaa was a world-class Finnish mathematician and theoretical computer scientist, renowned for his foundational contributions to automata theory, formal languages, and numerous other areas within theoretical computer science. His work profoundly shaped the mathematical foundations of the field and inspired generations of researchers. His scientific career was truly international. As a graduate student, he received a scholarship to Berkeley, where he attended J. Myhills automata theory seminar, which deeply influenced him. Upon returning to his home institution, the University of Turku, he established a research group in automata theory that became internationally renowned and continues to be active today, more than half a century later. In the late 1960s, Arto spent three years at what became his second academic home, the University of Western Ontario in Canada. During this time, his first book, Theory of Automata , was published, marking the beginning of his extraordinary career as an author of scientific books. Shortly thereafter, he published his iconic monograph Formal Languages , a highly influential work that cemented his status as a pioneering figure in the field. Over the years, Arto authored more than ten highly influential scientific monographs. Some were masterful explorations of their respective topics, while others introduced or promoted novel areas of study, including formal power series, L-systems, public-key cryptography, and DNA computing. In collaboration with Grzegorz Rozenberg, Arto co-authored a comprehensive treatment of formal languages. This monumental work, the Handbook of Formal Languages , spans three volumes and over 2,000 pages, serving as a definitive reference in the field. Beyond being an exceptionally original and creative researcher who continually explored new directions, Arto was also a leading educator in theoretical computer science. The remarkable clarity of his mathematical writing introduced many scientists to formal languages and automata theory, and his texts became fundamental to the education of multiple generations of researchers. Also, many of the Ph.D. students he guided went on to become prominent scientists worldwide, further demonstrating his profound impact as an educator and mentor. Arto served three five-year terms as an Academy Professor of the Academy of Finland, the highest academic position in the country. In 2001, the Academy of Finland awarded him the title of Academician, a prestigious honor granted to only 12 individuals in the sciences nationwide. He was a highly decorated scientist, a testimony to his prestige within the international scientific community. Arto was the recipient of nine honorary degrees and a distinguished member of several esteemed institutions, including the Finnish Academy of Science and Letters, the Finnish Society of Science and Letters, Academia Europaea, and the Hungarian Academy of Science as foreign member. His achievements were recognized with numerous prestigious awards, such asthe Prize of the Foundation for Finnish Culture, the Magnus Ehrnrooth Prize of the Finnish Society of Science and Letters, the European Association for Theoretical Computer Science Award, the Finnish Professor of the Year award, the Nokia Foundation Prize, and the title of Honorary Professor of the Al.I.Cuza University in Romania. In his honor, the Developments in Language Theory Symposium series has introduced the prestigious annual Arto Salomaa Prize. Arto made significant contributions to the scientific community. For instance, he played a key role in the establishment and early development of the European Association for Theoretical Computer Science, where he served as president from 1979 to 1985. Also, he was an active member of numerous editorial boards for prestigious academic journals and book series, further shaping the field through his expertise and leadership. We, the editors of the Theoretical Computer Science (TCS) journal Special Issue in his honor, express our deep sorrow at Artos passing. Each of us had the privilege of a warm and special friendship with him. We will miss him immensely and remain grateful for his presence in our lives and the profound influence he had on us. Heres to celebrating a remarkable life and the extraordinary scientific legacy that Arto leaves behind! Juhani Karhumki, Turku, Finland Jarkko Kari, Turku, Finland Lila Kari, Waterloo, Canada Hermann Maurer, Graz, Austria Ion Petre, Turku, Finland Grzegorz Rozenberg, Leiden, The Netherlands and Boulder, Colorado, USA February 2025 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Current Students",
        "content": "Graduate Students Please refer to the numerous sub-pages linked in the left-hand menu for various resources. Graduate Students 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Undergraduate Students",
        "content": "Western Computer Scienceallows undergraduates to specialize in Computer Science and pick up a Minor in Game Design, or Software Engineering. Undergraduates in other disciplines can also major or minor in Computer Science. With strong academics, many industrial and research opportunities available for our undergraduate students, excellent post-graduation job prospects, and Canada's best student experience , Western Computer Scienceisan exceptional choice for your undergraduate education. CURRENT STUDENTS FUTURE STUDENTS WHY CS AT WESTERN? Computer Science at Western offers you the opportunity to tailor your degree to your interests and to work with faculty who are involved in exciting research, all at one of the most beautiful campuses in Canada. Find out more. UNDERGRADUATE ADVISING Please open a support ticket or click here for more information. Open a Ticket SOCIAL MEDIA 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Post Docs",
        "content": "People People 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Floorplans",
        "content": "Facilities We are located in the Middlesex College building. The Computer Science department occupies the 3rd and 4th floor, of Middlesex College, as well as part of the 2nd floor and the Ground Floor. The Main office is located on the 3rd floor, beside the main elevator. For more information on Middlesex College floorplans please see the Western Accessibility website . Facilities 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements",
        "content": "The most recent News and Announcements are listed below. For a listing of ALL previous announcements, please refer to the individual year archive pages. 2019 // 2020 // 2021 // 2022 // 2023 // 2024 // 2025 News and Announcements Recent Announcements Arto Salomaa Tribute 02/28/2025 - Mathematician and theoretical computer scientist Arto Salomaa passed away on January 26, 2025. Arto served three years at Western in the late 1960s during which his first book, Theory of Automata, was published, and was made Doctor Honoris Causa of The University of Western Ontario in 2013. ... Read More Faculty of Science Award for Excellence in Graduate Student Mentoring 11/21/2024 - We are delighted to announce that Dr. Anwar Haque has been awarded this years Faculty of Science Award for Excellence in Graduate Student Mentoring. ... Read More AI Transforms Job Portal 06/25/2024 - By leveraging generative AI technologies, Dr Anwar Haque and his team at Bamboo Innovations, helped the London Economic Development Corporation (LEDC) transform their job portal. ... Read More Faculty of Science Distinguished Research Professor Award 05/03/2024 - We would like to congratulate Dr. Anwar Haque on being the recipient of this years Faculty of Science Distinguished Research Professor Award. ... Read More Canada Research Chair Appointment 03/14/2024 - We want to congratulate Dr. Angela Roberts on the finalization of her Canada Research Chair appointment. She is now a CRC in Data Analytics and Digital Health in Cognitive Aging and Dementia. ... Read More Duncanson Chair in Ethics and Technology 11/08/2023 - The Departments of Philosophy and Computer Science at Western University invite applicatons for the Duncanson Chair in Ethics and Technology. ... Read More 2023 Meet And Greet 10/05/2023 - Computer Science Faculty and Undergrad Student Meet and Greet, October 4, 2023. See the album! ... Read More Faculty Positions in Computer Science 07/12/2023 - New faculty positions are now available in the department of Computer Science for 2023-24 ... Read More New Teaching Award for Computer Science Instructors 03/24/2023 - We are excited to announce a brand new annual award this year to recognize teaching in Computer Science courses at Western. Submissions are due by April 11, 2023. ... Read More Faculty Positions in Computer Science 11/10/2022 - New Tenure Track faculty positions are now available in the department of Computer Science for 2023 ... Read More 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Current Undergraduate Students",
        "content": "Undergraduate Students The Department of Computer Science offers degrees in computer science featuring special course sequences in the third and fourth years for the fundamental areas of computer science (databases, operating systems, computer networks and software project management) as well as special topics courses in the emerging areas of the discipline (eg. software law, e-commerce, distributed applications management and DNA computing). Undergraduate Students 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Computer Science Outreach",
        "content": "Computer Science Outreach Computer Science Outreach 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Printing",
        "content": "Getting Help Several printers are located throughout the Department for use by Computer Science faculty, staff, and students. Available Printers Please see the Science Technology Services wiki for information on the available printers, along with setup guides for each printer. Printing Costs Printing is not free. We make use of the campus PaperCut system for print accounting . Users must have a positive PaperCut account balance to print in the Department of Computer Science. Per-page costs for a given printer can be found by clicking on the printer in the printer list . Graduate Students Graduate students PaperCut accounts are topped up to $12.50 in PaperCut credit each year. Checking Your Account Balance You can check your PaperCut account balance by logging in to https://papercut.uwo.ca with your Western credentials. Topping Up Your Account Undergraduate students requiring print credit can add funds to their PaperCut account online via credit card, or by purchasing a pre-paid PaperCut card through Western Libraries. Please see the Western Libraries PaperCut documentation for more details. Graduate students requiring additional credits should speak with their supervisors. Where Can My PaperCut Credit Be Used? Any credit in your PaperCut account can be used to print to printers in the Department of Computer Science, Western Libraries , and all other printers on campus connected to the PaperCut system. How to Print The CS lab computers should already have the department printers configured, as should most department PCs. (ie: grad student offices) Instructions on setting up a printer can be found by clicking on the printer in the printer list . Getting Help 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Full-Time Faculty",
        "content": "People Mark Daley Jrn Diedrichsen Michael Domaratzki Mahmoud El-Sakka Marwa Elsayed Zubair Fadlullah Fang (Fiona) Fang Anwar Haque Lucian Ilie Mike Katchabaw Charles Ling Daniel Lizotte Hanan Lutfiyya Nazim Madhavji Mostafa Milani Yalda Mohsenzadeh Marc Moreno Maza Apurva Narayan Umair Rehman Laura Reid Angela Roberts Bryan Sarlo Daniel Servos Kamran Sedig Roberto Solis-Oba Boyu Wang Grace Yi Kaizhong Zhang People 1878 - Western University Department of Computer Science Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 Privacy | Web Standards | Terms of Use | Accessibility Western Libraries Information Technology Services (ITS) Registrar Academic Calendar Academic Timetable"
    },
    {
        "title": "Faculty",
        "content": "People People 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Computer Science - Western University",
        "content": "Fall 2024 Meet and Greet News and Announcements Arto Salomaa Tribute 02/28/2025 - Mathematician and theoretical computer scientist Arto Salomaa passed away on January 26, 2025. Arto served three years at Western in the late 1960s during which his first book, Theory of Automata, was published, and was made Doctor Honoris Causa of The University of Western Ontario in 2013. ... Read More Faculty of Science Award for Excellence in Graduate Student Mentoring 11/21/2024 - We are delighted to announce that Dr. Anwar Haque has been awarded this years Faculty of Science Award for Excellence in Graduate Student Mentoring. ... Read More AI Transforms Job Portal 06/25/2024 - By leveraging generative AI technologies, Dr Anwar Haque and his team at Bamboo Innovations, helped the London Economic Development Corporation (LEDC) transform their job portal. ... Read More Faculty of Science Distinguished Research Professor Award 05/03/2024 - We would like to congratulate Dr. Anwar Haque on being the recipient of this years Faculty of Science Distinguished Research Professor Award. ... Read More All News Articles... Explore Computer Science at Western Events Our Social Media 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "CSD Future Students - Western University",
        "content": "Undergraduate Students \"The Department of Computer Science has been nothing but amazing. They seem to always be looking out for you when you need assistance whether it be academically or in personal matters.\" Ross \"The Department of Computer Science has been nothing but amazing. They seem to always be looking out for you when you need assistance whether it be academically or in personal matters.\" Ross \"I'm super grateful for all the opportunities that have come my way both inside and outside of the classroom.\" Shatha \"I'm super grateful for all the opportunities that have come my way both inside and outside of the classroom.\" Shatha \"I also completed a 12-month internship as part of my degree, which gave me an opportunity to apply the skills I've learned in the program.\" Ryan \"I also completed a 12-month internship as part of my degree, which gave me an opportunity to apply the skills I've learned in the program.\" Ryan \"Westerns game courses are fantastic. ... Some of my courses were even taught by local industry professionals who brought great first-hand knowledge of what it is like to work in the games industry. \" Karsten \"Westerns game courses are fantastic. ... Some of my courses were even taught by local industry professionals who brought great first-hand knowledge of what it is like to work in the games industry. \" Karsten \"Between inspiring professors, stimulating courses, and a comprehensive internship program, I was able to discover what Im passionate about and where I would like to go from here.\" Justine \"Between inspiring professors, stimulating courses, and a comprehensive internship program, I was able to discover what Im passionate about and where I would like to go from here.\" Justine Thinking of coming to Western for Computer Science?Let us show you why that is a great idea! Western Computer Science offers you the opportunity to tailor your degree to your interests and to work with faculty who are involved in exciting research, allwhile attendingone of the most beautiful campuses in Canada and enjoying Canada's best student experience . To help you with your decision, please check out the highlights below and the resources linked at left , such as the FAQ . Industry Internship / Co-Op Career Opportunities Flexible Undergraduate Programs Along with the typical Honors Specialization, Majors, and Minors in Computer Science, we also offer several concurrent degree programs that can be completed in 1 year less than taking each degree separately. Currently, the concurrent degrees we offer are: Another of our very popular programs is Computer Science Honours Specialization with a Minor in Game Design. Or you might consider our newHonors Specialization in Data Sciences combining Computer Science, Data Sciences and Statistical Science. You could also combine two of your interests by pursuing a Major in Computer Science with a Minor in Psychology or Business. Or, of course, you can just get a pure degree in Computer Science. Click here for more information on our programs . The choice is yours! Opportunities to Collaborate With World-Renowned Faculty There are a variety of avenues for undergraduate students to pursue undergraduate research. This includes paid research assistantships and capstone courses in fourth year where you can receive academic credit for undergraduate research. Students are encouraged to talk to faculty on possible opportunities. Undergraduate research broadens students with opportunities to participate in ground breaking research and to enhance their understanding of Computer Science. Students are able to use the knowledge/skills from multiple courses. Students often work on interdisciplinary teams that may include members from other units on campus.Student research is often published and students with research experience of With Western Computer Science students can work with computational neuroscience faculty researchers and other students to understand how the brainlearnsandcomputes to achieveintelligent behavior. Bioinformatics faculty researchers on biology related problems.Network/systems researchers are developing new ways to write software to leverage the advantages of 5G. Computer vision researchers are working on autonomous vehicles.Researchers are leveraging artificial intelligence to advance medical sciences, neuroscience and games as well as developing interfaces to deal with an instrumented world as the result of IoT. Collaborative Work and Experiential Learning By second year, you will be working closely with your classmates and the professors on group and individual projects. Interdisciplinary options are also expanding, especially with the Medical Sciences. Experiential Learningfocusses on enhancing on learning through real world experience. This includes capstone projects, internships and research. Two examplesof these are the Open Source Software Project and the Master the Mainframe course. Most Beautiful Campus in Canada While we may be biased here, we've heard from many students after visiting usand seeing Western's campus that they just had to come here! In fact, in 2004, Western won the Communities in Bloom competition in the Parks and Grounds category, even beating out Banff National Park. Western is consistently voted one of the most beautiful campuses in Canada. State of the Art Facilities Undergraduate Students 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Graduate Students",
        "content": "CURRENT STUDENTS FUTURE STUDENTS WHY CS AT WESTERN? Computer Science at Western offers you the opportunity to tailor your degree to your interests and to work with faculty who are involved in exciting research, all at one of the most beautiful campuses in Canada. Find out more. UNDERGRADUATE COUNSELLING Please open a support ticket or click here for more information. Open a Ticket SOCIAL MEDIA 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Academic Advising",
        "content": "Undergraduate Students Before reaching out to Academic Advising, please be sure to familiarize yourself with the Academic Calendar and the Science Academic Advising website. Many of your questions may already be addressed on one or both of those online resources. When to See a Department Academic Advisor Permission to waive normal Computer Science course or program requirements For having the Computer Science courses you want to take at another university evaluated prior to taking the course. Please pick up a form from your Dean's Office prior to seeing a Department Advisor. Office of the Registrar - Letter of Permission Information can be found here Note : You will still require final approval from your Faculty Academic Advisor for the LOP Evaluations of Computer Science courses completed in a prior degree. You must provide a copy (does not have to be an original copy ) of your transcript for evaluation. Course outlines for may also be required. For Computer Science courses taken at another university or college. You must provide a copy (does not have to be an original copy ) of your transcript for evaluation. Course outline for may also be required. Office of the Registrar - Letter of Permission Information can be found here Any questions related to course/program selection/requirements When to See a Faculty Academic Advisor Permissions other than those pertaining to Computer Science course or program requirements- ex. Course overload, to waive normal degree requirements, etc. For taking courses at another university Due to illness, bereavement, or other circumstances beyond your control that affect your academic performance For deferred final exams A waiver used when required to withdraw from the University for insufficient grade points in first or second year or for too many failures on your record you may request a grade-point waiver of the Dean of your Faculty of Registration General questions relating to progression requirements, university regulations, appeal procedures, etc. Any issues related to graduation. Computer Science Academic Advising To obtain academic advising from the Computer Science Department, please log in with your Western username and password below and open a support ticket. Our typical response time is 2-5 business days. To help us get to your ticket as soon as we can, please do not open more than one ticket at a time, and only reply back to an unanswered ticket with updates. Open a SUPPORT Ticket Same Day Zoom Drop-Ins For quick questions, we will be offering 10-minute drop-in zoom meetings on Mondays, Tuesdays, Thursdays and Fridays, at 1:30-2:30pm.*** Log-in to your Western Zoom account and use the link posted here to join the waiting room. Students are admitted in the order they arrive in the waiting room. https://westernuniversity.zoom.us/j/94167151256 Meeting ID: 941 6715 1256 Passcode: 267617 ***Upcoming Service Disruptions : There will be no drop-in between Dec 23 and January 6.Drop-ins will run on Monday, Tuesday, Wednesday and Thursday, for the week of January 6th. There will be no Zoom drop-in availability on Friday, January 10th. Special Permission Special permission is needed from the Department of Computer Science to waive normal course or program requirements. We do not give permissions to waive prerequisite requirements for foundational courses (i.e. those required by all CS modules) or module admission requirements, other than in very unique circumstances. For all other special permissions (timetable overloads, repeating courses over the attempt limit, etc.), see an Academic Advisor in your home faculty. Note: Special permissions are contingent upon approval of your Dean's Office. Course Equivalency Evaluations An evaluation for course equivalency may be needed for students in a variety of circumstances including: Note: Course Equivalency Evaluations are done in consultation with all relevant faculty to a given course. Computer Science Academic Advising Ticket Personnel Lisa Moszczynski - Primary Contact Undergraduate Coordinator Office: Middlesex College, MC 351 Sara Willemse - Graduation Checks and General Inquiries Administrative Assistant Office: Middlesex College, MC 355 Spenser Henstock Administrative Assistant Office: Middlesex College, MC 352 Undergraduate Students 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Getting Help",
        "content": "Getting Help Please see the options in the menu on the left for helpful information about Department of Computer Science services and resources. If you require technical support for issues with Computer Science accounts, computers, printers, or other lab equipment, please open a helpdesk ticket . If you have questions about our undergraduate or graduate programs, please see the department's contact page for the appropriate contact. Getting Help 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Employment",
        "content": "About Teaching Scholar Position Assistant Professor, Teaching Scholar Track in Computer Science The Department of Computer Science at Western University invites applications for a Teaching Scholar Position. Salary will be commensurate with qualifications and experience. The anticipated start date of the appointment is July 1, 2025, or as negotiated. This probationary appointment will be made at the rank of Assistant Professor with a workload of 60% teaching, 20% scholarship and 20% service. The teaching duties will include up to six one-semester courses per year. Consideration of applications will commence October 31, 2024 and will continue until the position is filled. The full posting is available here: https://www.uwo.ca/facultyrelations/careers/pdf/Advertisement---Teaching-Scholar-in-Computer-Science-_Computer-Science_FINAL.pdf Tenure Track Faculty Postions in Computer Science Two Open Rank Faculty Positions in Computer Science The Department of Computer Science at Western University invites applications for two faculty positions in Computer Science. Salary and rank are commensurate with qualifications and experience. The anticipated start date of the appointment is July 1, 2025, or as negotiated Successful applicants will be appointed at the rank of Assistant Professor (Probationary Tenuretrack), Associate Professor (Probationary Tenure-track or Tenured), or Full Professor with Tenure depending on qualifications and experience. The Department is considering applicants from any research area in Computer Science, with a particular interest in the areas of Data Science; AI and its applications in areas such as Healthcare, Neuroscience, Natural Language Processing, Security; Gaming and Graphics and HumanComputer Interaction. Consideration of applications will commence October 31, 2024 and will continue until the position is filled. The full posting is available here: https://www.uwo.ca/facultyrelations/careers/pdf/Advertisment---OPEN-Rank-x-2-_Computer-Science_-FINAL.pdf About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Software",
        "content": "Getting Help Computer Science students, staff, and faculty have access to a wide variety of free software, including Microsoft and VMware software, MATLAB, Maple, and more. Click the images below for more information. Getting Help 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Industry Partnerships",
        "content": "Industry Partnerships ... Coming Soon Industry Partnerships 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Administration",
        "content": "About Computer Science Department leadership team. Michael Domaratzki Zubair Fadlullah Bryan Sarlo About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Graduate Students",
        "content": "People This list has been created automatically based on registration data. Therefore it only lists students who are currently registered as a Graduate Student in Computer Science. Students: to create a personal web page, follow the instructions provided here . The names below link to where personal web pages are located, if they exist . People 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "AI Transforms Job Portal",
        "content": "When computer science professor Anwar Haque first connected with the London Economic Development Corporation (LEDC), the organization and its member companies were manually populating its job board with postings. It meant staff spent time copying and pasting employment opportunities and formatting them to fit with the style of LEDCs central job board. As London saw rapid population growth, job postings were exploding. Haque knew he could create a better solution. It was a very laborous job. Im agine all these companies are posting jobs on a daily basis, and each has a different format. You only have a couple of people to convene all of them, digest them and post them on the LEDC website in a unified style; its impossible to do that in real time, Haque said. So, Haque, along with his PhD student Muhammad Zakar, built the answer using artificial intelligence (AI). For the full article, please see the Western News Article 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Photo Gallery",
        "content": "About Here is a link to a gallery of photos of Middlesex College, the home of Computer Science at Western. These photos are all from Scott Feeney. Click on the image to go to the Flickr website to see larger versions. Various event photos are archived at the Computer Science Dept Flickr Archive About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Future Students",
        "content": "Graduate Students The Department of Computer Science at the University of Western Ontario, established in 1964, is internationally recognized for excellence in research and teaching. Our faculty have research collaborations across the department, across the campus, nationally and internationally. Our graduate students are vitally involved in the department; student representatives actively participate in departmental committees and meetings, and contribute to the decision making and shaping of the department's future. Some facts about our Department: State of the Art Facilities at Western Graduate Students 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Faculty of Science Distinguished Research Professor Award",
        "content": "We would like to congratulate Dr. Anwar Haque on being the recipient of this years Faculty of Science Distinguished Research Professor Award. This prestigious award recognizes exceptional leadership and research achievements. The award will allow Dr. Haque to expand his research through a significant industry consortium partnership, enhancing Western's innovation ecosystem in cybersecurity and smart systems. Dr. Haque joins previous winners of this award in the Department of Computer Science that include current faculty members Dr. Charles Ling (2014) and Dr. Marc Moreno Maza (2023). Please join us in congratulating Dr. Haque on this well-deserved distinguished honour! 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Staff",
        "content": "People Lindsay Bos Spenser Henstock Lisa Moszczynski Ange Muir Sara Willemse People 1878 - Western University Department of Computer Science Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 Privacy | Web Standards | Terms of Use | Accessibility Western Libraries Information Technology Services (ITS) Registrar Academic Calendar Academic Timetable"
    },
    {
        "title": "People",
        "content": "People People 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Faculty of Science Award for Excellence in Graduate Student Mentoring",
        "content": "We are delighted to announce that Dr. Anwar Haque has been awarded this years Faculty of Science Award for Excellence in Graduate Student Mentoring. This distinguished honor recognizes individuals who demonstrate exemplary and sustained achievements in graduate student supervision and mentoring. Dr. Haques outstanding record in these areas has set a remarkable standard. As a role model and mentor, Dr. Haque has made significant contributions to the training and preparation of his graduate students, supporting their success in graduate studies at Western and their subsequent careers in academia and industry. Please join us in celebrating this well-deserved recognition of Dr. Haques exceptional contributions in graduate student supervision and mentoring. Congratulations, Dr. Haque, and best wishes for your continued success! 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Contact",
        "content": "About Contact Information Department of Computer Science Rm. 355, Middlesex College Western University London ON N6A 5B7 Canada Tel: (519) 661-3566 Fax: (519) 661-3515 Western CS onSocial Media Related Links Parking and Campus Maps How to reach us: Contact List Location About 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "New Teaching Award for Computer Science Instructors",
        "content": "We are starting a brand new annual award this year to recognize teaching in Computer Science courses at Western. If you have had a teacher in a Western Computer Science course that has inspired you or made the subject material more enjoyable or exciting or interesting or easier to understand because of their teaching methods, please consider filling out the form below (only 5 questions). The CS Awards committee will read all the submissions and pick a winner for the 2022/2023 school year. Here is the nomination form: https://uwo.eu.qualtrics.com/jfe/form/SV_cuaLvM1epCgGZcG Submissions are due by April 11, 2023. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2020",
        "content": "All News and Announcements for the year 2020 are listed below. Professor Haques research work on ISP network costing in partnership with Bell Canada wins the Best Paper Award! Congratulations to Professor Anwar Haque on being awarded the 2020 IEEE CCECE Leadership Award We are now hosting virtual drop-in hours once a week for students who would like to meet individually with a departmental counsellor but are unable to visit campus. Join us each Friday from 9:30 am 11:30 am on Zoom We are pleased to announce that Computer Science Professor Mark Daley will become VP Research at the Canadian Institute for Advanced Research (CIFAR). This is a three year secondment. He will continue his research and graduate supervision. Western is partnering with Bell on a 5G research initiative. Bell will invest $2.7 million and deploy 5G network equipment and infrastructure throughout the Western campus. The partnership will also fund research and development initiatives, training opportunities, and technological innovations. The COVID-19 Canada Site includes both real-time visualizations and statistical analysis, created from data released daily by the Government of Canada, provincial governments and other public accessible data sources. We would like to congratulate Xinyu Yun and Tanner Bohn for being selected to receive the best student paper award by Canadian AI 2020 Gurjit S. Randhawa, a Computer Science PhD student at Western, is the first author of a paper recently published in PLOS One that describes a machine learning-based tool that allows researchers to quickly and easily classify a novel pathogen like COVID-19 virus in just minutes Jacqueline Kueper, MSC17, did not intend to be a pioneer. But the more she thought about the possibilities, the more she realized becoming Westerns first combined PhD candidate made sense. Currently, Kueper is pursuing a doctorate in Epidemiology & Biostatistics and Computer Science the first Western student to study two different fields for one PhD. The deptartment of Computer Science is pleased to announce that Mostafa Milani will be joining our Faculty in July. His research interests are data management, data quality, data cleaning and applications of AI in data management. As of 19-Mar-2020 the Computer Science main office has moved virtual, due to COVID-19. Computer Careers What kinds of computing jobs are out there and the path to follow to that job. A Free Guide for prospective students and career advisors. The Dept of Computer Science is pleased to announce a search for a probationary (tenure track) position in Databases as well as a position in Networking Awarded annually to students in year three of a Computer Science or Statistical and Actuarial Science program that is Module based on academic achievement, and has an interest in pursuing a career in big data, data science, or artificial intelligence. Deadline: 18/Feb/2020 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2024",
        "content": "All News and Announcements for the year 2025 are listed below. Mathematician and theoretical computer scientist Arto Salomaa passed away on January 26, 2025. Arto served three years at Western in the late 1960s during which his first book, Theory of Automata, was published, and was made Doctor Honoris Causa of The University of Western Ontario in 2013. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2024",
        "content": "All News and Announcements for the year 2024 are listed below. We are delighted to announce that Dr. Anwar Haque has been awarded this years Faculty of Science Award for Excellence in Graduate Student Mentoring. By leveraging generative AI technologies, Dr Anwar Haque and his team at Bamboo Innovations, helped the London Economic Development Corporation (LEDC) transform their job portal. We would like to congratulate Dr. Anwar Haque on being the recipient of this years Faculty of Science Distinguished Research Professor Award. We want to congratulate Dr. Angela Roberts on the finalization of her Canada Research Chair appointment. She is now a CRC in Data Analytics and Digital Health in Cognitive Aging and Dementia. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2023",
        "content": "All News and Announcements for the year 2023 are listed below. The Departments of Philosophy and Computer Science at Western University invite applicatons for the Duncanson Chair in Ethics and Technology. Computer Science Faculty and Undergrad Student Meet and Greet, October 4, 2023. See the album! New faculty positions are now available in the department of Computer Science for 2023-24 We are excited to announce a brand new annual award this year to recognize teaching in Computer Science courses at Western. Submissions are due by April 11, 2023. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Faculty Positions in Computer Science",
        "content": "New faculty positions are now available in the department of Computer Science. Western University invites applications for a three-year Limited-Term faculty appointment at the rank of Lecturer or Assistant Professor, depending on qualifications and experience, to participate primarily in the delivery of Computer Science undergraduate programs. The anticipated start date is January 1, 2024 The search committee will start reviewing applications in September. The full posting is available here: https://www.uwo.ca/facultyrelations/careers/pdf/Science_Advertisment_CS_LT_2023.pdf For details of other Faculty of Science positions please see the Faculty relations website. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2022",
        "content": "All News and Announcements for the year 2022 are listed below. New Tenure Track faculty positions are now available in the department of Computer Science for 2023 Computer Science Student Jaky Kueper has earned the 2022 Governor Generals Gold Medal and is also the First Ever Graduate to Earn a Combined PhD at Western. Congratulations to winners in Ubisoft Toronto NEXT Student Challenge from Western! Professor Anwar Haque is one of eight new Western-funded projects, whose researchers are examining ways the universitys unique Bell-Western 5G network can transform lives for the better. The Computer Science Office staff will be working virtually from now till January 28, 2022. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Duncanson Chair in Ethics and Technology",
        "content": "The Departments of Philosophy and Computer Science at Western University invite applications for the Duncanson Chair in Ethics and Technology. The successful applicant will be appointed at the rank of Assistant Professor (Probationary Tenure-track), Associate Professor (Probationary Tenure-track or Tenured), or Professor with Tenure depending on qualifications and experience. The anticipated start date is July 1, 2024 The full posting is available here: https://www.uwo.ca/facultyrelations/careers/pdf/Advertisement_ArtsScience_Duncanson-Chair_2023.pdf For details of other Faculty of Science positions please see the Faculty relations website. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "News and Announcements 2019",
        "content": "All News and Announcements for the year 2019 are listed below. Welcome to the new Computer Science website! Featuring a clean and simple front page, and responsive web design. Please see the link for a tour of the new layout and features A $3-million investment by RBC has established The RBC Data Analytics and Artificial Intelligence Project at Western, an expansion of the universitys ongoing cross-disciplinary work in data analytics and AI focused on answering big questions for the good of society. Big thank you to Shatha, Eric and Art for running the Robot Event at the annual Science Olympics, May 2019. Check the article for a link to a flickr album of photos of battling robots! Thank you to the Iranian Computer Science Grad students for the wonderful presentation and entertainment and food in celebration of the Iranian New Year (Nowruz). Another successful March Break Open House at Western. Big thank you to all of our volunteers. See the main page for a flickr album of photos. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Faculty Positions in Computer Science",
        "content": "New Tenure Track faculty positions are now available in the department of Computer Science starting in 2023. First position: The Department of Computer Science in the Faculty of Science at Western University, one of Canadas leading research-intensive universities, is seeking applicants for a faculty position in Computer Science in the areas of Human-Computer Interaction and Data Visualization ( details ); Second position: The Department of Computer Science in the Faculty of Science at Western University, one of Canadas leading research-intensive universities, is seeking applicants for a faculty position in the areas of Computer Systems, Software Engineering and Cybersecurity ( details ); Third position: The Department of Computer Science in the Faculty of Science at Western University, one of Canadas leading research-intensive universities, is seeking applicants for a faculty position in Computer Science in the areas of Computer Gaming and Graphics ( details ). To address Westerns commitment to equity, diversity, inclusion, and decolonization, applicants who self-identify as a woman, Indigenous person, racialized communities, persons with a disability, or who identify as 2SLGBTQ+ are encouraged to apply to these positions. For full details of these and other Faculty of Science positions please see the Faculty relations website. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "2023 Meet And Greet",
        "content": "The annual Meet and Greet Event for Computer Science Faculty and Undergrad Students took place on October 4th, 2023. The location was on the \"Concrete Beach\" at UCC under the tent. Lot of opportunity for food and mingling. To see photos please visit our Flickr Photo Album of the event. 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    },
    {
        "title": "Canada Research Chair Appointment",
        "content": "The Department of Computer Science at Western would like to congratulate Dr. Angela Roberts on the finalization of her Canada Research Chair appointment. Dr. Roberts is the new Canada Research Chair (CRC) in Data Analytics and Digital Health in Cognitive Aging and Dementia . We are very proud that she has a home with us in Computer Science, where she will continue with her great work. The news item is linked below. Congratulations, Dr. Roberts! https://news.westernu.ca/2024/03/new-canada-research-chairs-named-at-western/ 1878 - Western University Department of Computer Science Room 355, Middlesex College, Western University, London, Ontario, Canada, N6A 5B7 Tel: 519-661-3566 cs-dept@uwo.ca Privacy | Web Standards | Terms of Use | Accessibility"
    }
]